_Rarzrabotki/Rarus/USO2/Documents/УСОERP_НазначениеИсполнителейРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_НазначениеИсполнителейРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_НазначенияИсполнителейРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДляПоиска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДляПоиска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СтоимостьРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СтоимостьРесурсов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ВидыИспользованияРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ВидыИспользованияРабочегоВремени</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКодБюджетный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКодБюджетный2009</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеВремя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целосменное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_НазначениеИсполнителейРабот/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполнения

Функция ДанныеОВремениСотрудников(ДанныеТабеля, СписокСотрудников = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыЗаполнения = УчетРабочегоВремениРасширенный.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
	
	ПараметрыЗаполнения.ИмяВТСотрудники = "ВТСотрудники";
	ПараметрыЗаполнения.ИмяВТРезультат = "ВТДанныеУчетаВремениИСостоянийСотрудников";
	ПараметрыЗаполнения.РассчитыватьПлановоеВремя = Ложь;
	ПараметрыЗаполнения.Организация  = ДанныеТабеля.Организация;
	ПараметрыЗаполнения.ДатаАктуальности  = НачалоМесяца(ДанныеТабеля.Дата);
	ПараметрыЗаполнения.ДатаНачала = ДанныеТабеля.ДатаНачала;
	ПараметрыЗаполнения.ДатаОкончания = (ДанныеТабеля.ДатаОкончания);
	
	ПараметрыЗаполнения.МесяцДатаНачала = НачалоМесяца(ДанныеТабеля.ДатаНачала);
	ПараметрыЗаполнения.МесяцДатаОкончания = КонецМесяца(ДанныеТабеля.ДатаОкончания);
	ПараметрыЗаполнения.ПолучатьУжеРассчитанныеДанные = Ложь;
	ПараметрыЗаполнения.ПересчитыватьФактическоеВремя = Истина;
	
	//Если ЗначениеЗаполнено(ДанныеТабеля.Подразделение) Тогда
	//	ПараметрыЗаполнения.Подразделение = ДанныеТабеля.Подразделение;
	//КонецЕсли;	
	
	//ПараметрыЗаполнения.НеучитываемыеРегистраторы.Добавить(ДанныеТабеля.Ссылка);
	
	//Если ЗначениеЗаполнено(ДанныеТабеля.ИсправленныйДокумент) Тогда
	//	ПараметрыЗаполнения.НеучитываемыеРегистраторы.Добавить(ДанныеТабеля.ИсправленныйДокумент);
	//КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗаполнения.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗаполнения.ДатаОкончания);
	
	Если СписокСотрудников = Неопределено Тогда
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
		ПараметрыПолученияСотрудников.Организация  = ДанныеТабеля.Организация;
		ПараметрыПолученияСотрудников.НачалоПериода = ДанныеТабеля.ДатаНачала;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = ДанныеТабеля.ДатаОкончания;
		ПараметрыПолученияСотрудников.ИмяВТФизическиеЛица = Неопределено;
		// Подработки
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПодработки") Тогда
			
			ПараметрыПолученияСотрудников.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
			
		КонецЕсли;	
		// Подработки конец
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников, "ВТСотрудникиОрганизации");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизации.Сотрудник,
		|	&ДатаНачала,
		|	&ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации";
		
		Запрос.Выполнить();
		
	Иначе
		ТаблицаСотрудников = Новый ТаблицаЗначений;
		ТаблицаСотрудников.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		ТаблицаСотрудников.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
		ТаблицаСотрудников.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
		
		Для каждого Сотрудник Из СписокСотрудников Цикл
			СтрокаТаблицы = ТаблицаСотрудников.Добавить();
			СтрокаТаблицы.Сотрудник = Сотрудник;
			СтрокаТаблицы.ДатаНачала = ДанныеТабеля.ДатаНачала;
			СтрокаТаблицы.ДатаОкончания = (ДанныеТабеля.ДатаОкончания);
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ТаблицаСотрудников", ТаблицаСотрудников);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСотрудников.Сотрудник,
		|	ТаблицаСотрудников.ДатаНачала,
		|	ТаблицаСотрудников.ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&ТаблицаСотрудников КАК ТаблицаСотрудников";
		
		Запрос.Выполнить();
		
	КонецЕсли;	
	
	УчетРабочегоВремениРасширенный.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗаполнения);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеУчетаВремениИСостоянийСотрудников.Дата КАК Дата,
	|	ДанныеУчетаВремениИСостоянийСотрудников.ВидУчетаВремени КАК ВидУчетаВремени,
	|	ДанныеУчетаВремениИСостоянийСотрудников.Дни КАК Дни,
	|	ДанныеУчетаВремениИСостоянийСотрудников.Часы КАК Часы,
	|	ДанныеУчетаВремениИСостоянийСотрудников.НормаЧасов,
	|	ВЫБОР
	|		КОГДА ОписаниеВидовВремени.Ссылка = &Явка
	|			ТОГДА 1
	|		КОГДА ОписаниеВидовВремени.ОсновноеВремя = &Явка
	|			ТОГДА 2
	|		КОГДА ОписаниеВидовВремени.Ссылка = &ВечерниеЧасы
	|			ТОГДА 3
	|		КОГДА ОписаниеВидовВремени.ОсновноеВремя = &ВечерниеЧасы
	|			ТОГДА 3
	|		КОГДА ОписаниеВидовВремени.Ссылка = &НочныеЧасы
	|			ТОГДА 5
	|		КОГДА ОписаниеВидовВремени.ОсновноеВремя = &НочныеЧасы
	|			ТОГДА 6
	|		КОГДА ОписаниеВидовВремени.Ссылка = &Сверхурочно
	|			ТОГДА 7
	|		КОГДА ОписаниеВидовВремени.ОсновноеВремя = &Сверхурочно
	|			ТОГДА 8
	|		ИНАЧЕ 9
	|	КОНЕЦ КАК ПриоритетВидаВремени
	|ИЗ
	|	ВТДанныеУчетаВремениИСостоянийСотрудников КАК ДанныеУчетаВремениИСостоянийСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ДанныеУчетаВремениИСостоянийСотрудников.Сотрудник = Сотрудники.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыИспользованияРабочегоВремени КАК ОписаниеВидовВремени
	|		ПО ДанныеУчетаВремениИСостоянийСотрудников.ВидУчетаВремени = ОписаниеВидовВремени.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование,
	|	Сотрудник,
	|	Дата,
	|	ПриоритетВидаВремени,
	|	ОписаниеВидовВремени.Наименование,
	|	ВидУчетаВремени";
	
	Запрос.УстановитьПараметр("Явка", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Явка"));
	Запрос.УстановитьПараметр("ВечерниеЧасы", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РаботаВечерниеЧасы"));
	Запрос.УстановитьПараметр("НочныеЧасы", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РаботаНочныеЧасы"));
	Запрос.УстановитьПараметр("Сверхурочно", ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Сверхурочные"));
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ДоступныеДляВводаВидыВремени() Экспорт
	ДоступныеДляВводаВидыВремени = Новый Соответствие;
	
	ВидВремениРабочееВремя = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя");	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееВремя", ВидВремениРабочееВремя);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыИспользованияРабочегоВремени.ОсновноеВремя
	|ИЗ
	|	Справочник.ВидыИспользованияРабочегоВремени КАК ВидыИспользованияРабочегоВремени
	|ГДЕ
	|	ВидыИспользованияРабочегоВремени.Ссылка <> &РабочееВремя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеДляВводаВидыВремени.Вставить(Выборка.ОсновноеВремя, Истина);
	КонецЦикла;
	
	Возврат ДоступныеДляВводаВидыВремени;
КонецФункции	

#КонецОбласти

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаНазначениеРабот(),		"ТаблицаНазначенияИсполнителейРабот");
	
	
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Результат = Запрос.ВыполнитьПакет();
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	УСОERP_НазначениеИсполнителейРабот.Дата КАК Период,
	|	УСОERP_НазначениеИсполнителейРабот.Ссылка КАК Ссылка,
	|	УСОERP_НазначениеИсполнителейРабот.ОбъектСтроительства,
	|	УСОERP_НазначениеИсполнителейРабот.Организация КАК Организация
	|ИЗ
	|	Документ.УСОERP_НазначениеИсполнителейРабот КАК УСОERP_НазначениеИсполнителейРабот
	|ГДЕ
	|	УСОERP_НазначениеИсполнителейРабот.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	//
	Запрос.УстановитьПараметр("ОбъектСтроительства",	Реквизиты.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Период",					Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",			Реквизиты.Организация);
	
КонецПроцедуры

Функция ТекстЗапросаНазначениеРабот()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Дата КАК Период,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка КАК Регистратор,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка.Организация,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка.Подразделение,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка.ОбъектСтроительства,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Работа,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ресурс,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.СоставРесурса,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Сотрудник,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Должность,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Дата КАК Дата,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.КоличествоЧасов КАК Количество
	|ИЗ
	|	Документ.УСОERP_НазначениеИсполнителейРабот.Исполнители КАК УСОERP_НазначениеИсполнителейРаботИсполнители
	|ГДЕ
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка = &Ссылка  И  УСОERP_НазначениеИсполнителейРаботИсполнители.КоличествоЧасов > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Сотрудник,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Дата	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УСОERP_ЗаданиеНаРаботу";
	КомандаПечати.Представление = НСтр("ru = 'Задание на работу'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УСОERP_ЗаданиеНаРаботу") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УСОERP_ЗаданиеНаРаботу",
		НСтр("ru = 'Задание на работу'"),
		СформироватьПечатнуюФормуЗаданиеНаРаботу(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуЗаданиеНаРаботу(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка КАК Документ,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Работа КАК Работа,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ресурс КАК Ресурс,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.СоставРесурса КАК СоставРесурса,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Сотрудник КАК Сотрудник,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Дата КАК Дата,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.КоличествоЧасов КАК КоличествоЧасов,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Должность КАК Должность,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Работа.КодСДР КАК РаботаКодСДР,
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Работа.ПорядокСортировки КАК РаботаПорядокСортировки
	|ИЗ
	|	Документ.УСОERP_НазначениеИсполнителейРабот.Исполнители КАК УСОERP_НазначениеИсполнителейРаботИсполнители
	|ГДЕ
	|	УСОERP_НазначениеИсполнителейРаботИсполнители.Ссылка В(&МассивДокументов)"; 	
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДокументов = Результат.Скопировать();
	ТаблицаДокументов.Свернуть("Документ");
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УСОERP_НазначениеИсполнителейРабот.ПФ_MXL_ЗаданиеНаРаботу");
	
	ПерваяСтрока = Истина;
	
	Для Каждого ВыборкаПоДокументам ИЗ ТаблицаДокументов Цикл  		
		
		ТаблицаДокумента = Результат.Скопировать(Новый Структура("Документ",ВыборкаПоДокументам.Документ));
		
		ТаблицаРесурсов  = ТаблицаДокумента.Скопировать();
		
		ТаблицаРесурсов.Свернуть("Ресурс,СоставРесурса");
		
		ТаблицаРазныхРесурсов = ТаблицаДокумента.Скопировать();
		ТаблицаРазныхРесурсов.Свернуть("Ресурс,Сотрудник,СоставРесурса");
		
		Для Каждого ВыборкаРесурс ИЗ ТаблицаРесурсов Цикл
			
			Если НЕ ПерваяСтрока Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПерваяСтрока = Ложь;
			
			СтруктураОтбора = Новый Структура("Ресурс,СоставРесурса",ВыборкаРесурс.Ресурс,ВыборкаРесурс.СоставРесурса);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьШапка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоДокументам.Документ);
			ОбластьМакета.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоДокументам.Документ.Номер);
			ОбластьМакета.Параметры.ДатаДокумента = Формат(ВыборкаПоДокументам.Документ.Дата,"ДФ=dd.MM.yyyy");
			ТабРазныхРесурсов = ТаблицаРазныхРесурсов.Скопировать(СтруктураОтбора);
			
			ЭтоБригада = ТабРазныхРесурсов.Количество()> 1;
			
			ОбластьМакета.Параметры.Исполнитель = ?(ЭтоБригада,ТабРазныхРесурсов.Получить(0).СоставРесурса,ТабРазныхРесурсов.Получить(0).Сотрудник);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);  		 
			
			ТаблицаРабот = ТаблицаДокумента.Скопировать(СтруктураОтбора);
			ТаблицаРабот.Свернуть("Работа,Ресурс,Должность","КоличествоЧасов");
			Запрос.УстановитьПараметр("ТабРабот",ТаблицаРабот);
			Запрос.УстановитьПараметр("Дата",ВыборкаПоДокументам.Документ.Дата);
			Запрос.УстановитьПараметр("ВидЦены",Константы.ВидЦеныПлановойСтоимостиМатериаловРабот.Получить());
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТабРабот.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
			|	ТабРабот.Ресурс КАК Ресурс,
			|	ТабРабот.Должность КАК Должность,
			|	ТабРабот.КоличествоЧасов КАК КоличествоЧасов
			|ПОМЕСТИТЬ ВрТаб
			|ИЗ
			|	&ТабРабот КАК ТабРабот
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВрТаб.Работа КАК Работа,
			|	СУММА(ВрТаб.КоличествоЧасов) КАК КоличествоЧасов,
			|	СУММА(ВрТаб.КоличествоЧасов * ЕСТЬNULL(УСОERP_СтоимостьРесурсовСрезПоследних.Стоимость, 0) * ВЫБОР
			|			КОГДА ЕСТЬNULL(УСОERP_СтоимостьРесурсовСрезПоследних.Курс, 0) = 0
			|				ТОГДА 1
			|			ИНАЧЕ ЕСТЬNULL(УСОERP_СтоимостьРесурсовСрезПоследних.Курс, 0)
			|		КОНЕЦ) КАК Сумма
			|ИЗ
			|	ВрТаб КАК ВрТаб
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_СтоимостьРесурсов.СрезПоследних(&Дата, ВидЦены = &ВидЦены) КАК УСОERP_СтоимостьРесурсовСрезПоследних
			|		ПО ВрТаб.Ресурс = УСОERP_СтоимостьРесурсовСрезПоследних.Ресурс
			|			И ВрТаб.Должность = УСОERP_СтоимостьРесурсовСрезПоследних.ОбъектСтоимости
			|
			|СГРУППИРОВАТЬ ПО
			|	ВрТаб.Работа
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВрТаб.Работа.ПорядокСортировки,
			|	ВрТаб.Работа.КодСДР"; 
			
			ТабЗапроса = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Выборка ИЗ ТабЗапроса Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСтрокаРаботы");
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.Заполнить(Выборка.Работа);
				ОбластьМакета.Параметры.Цена = ?(Выборка.КоличествоЧасов = 0 ,0 ,Выборка.Сумма/Выборка.КоличествоЧасов);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла; 
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьСтрокаРаботыИтого");
			
			ОбластьМакета.Параметры.КоличествоЧасов = ТаблицаРабот.Итог("КоличествоЧасов");
			ОбластьМакета.Параметры.Сумма = ТабЗапроса.Итог("Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);			
			
			ТабДат = ТаблицаДокумента.Скопировать(СтруктураОтбора);
			
			Строки = ТабДат.НайтиСтроки(Новый Структура("КоличествоЧасов",0));
			
			Для Каждого НайденнаяСтрока ИЗ Строки Цикл
				
				ТабДат.Удалить(НайденнаяСтрока);
				
			КонецЦикла;  			
			
			ТабДат.Свернуть("Дата");
			ТабДат.Сортировать("Дата ВОЗР");
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьШапкаРаботы|ОбластьРаботыНачало");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);			
			
			Для Каждого СтрокаДат ИЗ ТабДат Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьШапкаРаботы|ОбластьРаботыДата");
				ОбластьМакета.Параметры.Дата= СтрокаДат.Дата;
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьШапкаРаботы|ОбластьРаботыИтого");
			ОбластьМакета.Параметры.Значение  =  ТаблицаРабот.Итог("КоличествоЧасов");
			ТабличныйДокумент.Присоединить(ОбластьМакета);
			
			ТабСотрудников = ТаблицаДокумента.Скопировать(СтруктураОтбора);
			ТабСотрудников.Свернуть("Сотрудник");
			
			ТабСотрудников.Сортировать("Сотрудник ВОЗР");
			
			Для Каждого СтрокаСотрудников ИЗ ТабСотрудников Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаГруппа|ОбластьРаботыНачало");
				
				ОбластьМакета.Параметры.Код = СтрокаСотрудников.Сотрудник.Код;
				ОбластьМакета.Параметры.Значение = СтрокаСотрудников.Сотрудник.Наименование;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Для Каждого СтрокаДат ИЗ ТабДат Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаГруппа|ОбластьРаботыДата");
					ОбластьМакета.Параметры.Значение = ТаблицаДокумента.Скопировать(Новый Структура("Ресурс,СоставРесурса,Дата,Сотрудник",ВыборкаРесурс.Ресурс,ВыборкаРесурс.СоставРесурса,СтрокаДат.Дата,СтрокаСотрудников.Сотрудник)).Итог("КоличествоЧасов");;
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаГруппа|ОбластьРаботыИтого");
				ОбластьМакета.Параметры.Значение = ТаблицаДокумента.Скопировать(Новый Структура("Ресурс,СоставРесурса,Сотрудник",ВыборкаРесурс.Ресурс,ВыборкаРесурс.СоставРесурса,СтрокаСотрудников.Сотрудник)).Итог("КоличествоЧасов");
				ТабличныйДокумент.Присоединить(ОбластьМакета);
				
				ТабДок = ТаблицаДокумента.Скопировать(СтруктураОтбора);
				ТабРабот = ТабДок.Скопировать(Новый Структура("Сотрудник",СтрокаСотрудников.Сотрудник));
				
				ТабРабот.Свернуть("Работа,РаботаПорядокСортировки");
				
				ТабРабот.Сортировать("РаботаПорядокСортировки");
				
				Для Каждого СтрокаРабот ИЗ ТабРабот Цикл
					
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаСтрока|ОбластьРаботыНачало");
					ОбластьМакета.Параметры.Код = СтрокаРабот.Работа.КодСДР;
					ОбластьМакета.Параметры.Значение = СтрокаРабот.Работа.Наименование;
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					Для Каждого СтрокаДат ИЗ ТабДат Цикл
						
						ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаСтрока|ОбластьРаботыДата");
						ОбластьМакета.Параметры.Значение = ТаблицаДокумента.Скопировать(Новый Структура("Работа,Дата,Сотрудник",СтрокаРабот.Работа,СтрокаДат.Дата,СтрокаСотрудников.Сотрудник)).Итог("КоличествоЧасов");
						ТабличныйДокумент.Присоединить(ОбластьМакета);
						
					КонецЦикла; 
					
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьРаботаСтрока|ОбластьРаботыИтого");
					ОбластьМакета.Параметры.Значение = ТаблицаДокумента.Скопировать(Новый Структура("Ресурс,СоставРесурса,Сотрудник,Работа",ВыборкаРесурс.Ресурс,ВыборкаРесурс.СоставРесурса,СтрокаСотрудников.Сотрудник,СтрокаРабот.Работа)).Итог("КоличествоЧасов");
					
					ТабличныйДокумент.Присоединить(ОбластьМакета);
					
				КонецЦикла;  				
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьПодвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла; 	
		
	КонецЦикла; 	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
